# 变化参数λ的值

# 随着计算方的增加
import paperplotlib as ppl
import numpy as np
from icecream import ic

# 比较算法1,2,3

# 数据集2的数据
y2 = [88.46, 81.52, 82.1, 81.68, 76.84, 72.81, 47.39, 20.62, 12.66, 6.92, 2.48, 1.2, 44.08, 19.56, 12.32, 6.15, 2.27, 1.01]
# 合成数据集06
y06 = [19.4, 38.28, 66.75, 83.24, 110.18, 136.38, 4.93, 3.05, 3.5, 11.7, 6.6, 10, 4.76, 2.8, 3.59, 11.54, 6.61, 10.14]
y07 = [17.85, 36.96, 62.17, 82.38, 108.9, 131.2, 2.27, 2.95, 3.45, 11.67, 6.6, 9.95, 2.3, 2.89, 3.49, 11.85, 6.7, 10.33]
y08 = [20.89, 41.4, 73.12, 92.79, 126.74, 157.72, 7.37, 13.32, 8.9, 10.29, 25.06, 18.14, 7.22, 12.76, 8.21, 10.24, 25.05, 18.41]
y09 = [23.48, 45.38, 81.01, 108.43, 150.5, 189.04, 11.31, 9.54, 20.18, 16.08, 22.56, 28.9, 10.85, 9.51, 19.29, 14.27, 20.54, 27.05]
y10 = [13.3, 35.67, 62.45, 79.02, 105.02, 125.4, 0.768, 2.63, 4.11, 4.09, 12.55, 10.69, 0.729, 2.03, 3.88, 4.13, 11.44, 10.36]

# 多折线图
# 比较算法1,2,3
all_data = np.array([y2, y06, y07, y08, y09, y10])  # [10, 18]

line_names = ['alg1', 'alg2', 'alg3']

for i, y_data in enumerate(all_data):
    line_graph = ppl.LineGraph()
    x_data = [i + 1 for i in range(6)]
    line_graph.plot_2d(x_data, np.reshape(y_data, [3, 6]), line_names)
    line_graph.x_label = 'Number of Partys'
    line_graph.y_label = 'Running Time (Minute)'
    line_graph.save(f'line_graph{i}.png')
